PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_rcu.h
/* CK_HXTAL divider previous PLL */
#define CFG1_PREDV(regval)         (BITS(0,3) & ((uint32_t)(regval) << 0))
#define RCU_PLL_PREDV1              CFG1_PREDV(0)                         /*!< PLL not divided */
#define RCU_PLL_PREDV2              CFG1_PREDV(1)                         /*!< PLL divided by 2 */
#define RCU_PLL_PREDV3              CFG1_PREDV(2)                         /*!< PLL divided by 3 */
#define RCU_PLL_PREDV4              CFG1_PREDV(3)                         /*!< PLL divided by 4 */
#define RCU_PLL_PREDV5              CFG1_PREDV(4)                         /*!< PLL divided by 5 */
#define RCU_PLL_PREDV6              CFG1_PREDV(5)                         /*!< PLL divided by 6 */
#define RCU_PLL_PREDV7              CFG1_PREDV(6)                         /*!< PLL divided by 7 */
#define RCU_PLL_PREDV8              CFG1_PREDV(7)                         /*!< PLL divided by 8 */
#define RCU_PLL_PREDV9              CFG1_PREDV(8)                         /*!< PLL divided by 9 */
#define RCU_PLL_PREDV10             CFG1_PREDV(9)                         /*!< PLL divided by 10 */
#define RCU_PLL_PREDV11             CFG1_PREDV(10)                        /*!< PLL divided by 11 */
#define RCU_PLL_PREDV12             CFG1_PREDV(11)                        /*!< PLL divided by 12 */
#define RCU_PLL_PREDV13             CFG1_PREDV(12)                        /*!< PLL divided by 13 */
#define RCU_PLL_PREDV14             CFG1_PREDV(13)                        /*!< PLL divided by 14 */
#define RCU_PLL_PREDV15             CFG1_PREDV(14)                        /*!< PLL divided by 15 */
#define RCU_PLL_PREDV16             CFG1_PREDV(15)                        /*!< PLL divided by 16 */

/* USART0 clock source selection */
#define CFG2_USART0SEL(regval)      (BITS(0,1) & ((uint32_t)(regval) << 0))
#define RCU_USART0SRC_CKAPB2        CFG2_USART0SEL(0)                     /*!< CK_USART0 select CK_APB2 */
#define RCU_USART0SRC_CKSYS         CFG2_USART0SEL(1)                     /*!< CK_USART0 select CK_SYS */
#define RCU_USART0SRC_LXTAL         CFG2_USART0SEL(2)                     /*!< CK_USART0 select LXTAL */
#define RCU_USART0SRC_IRC8M         CFG2_USART0SEL(3)                     /*!< CK_USART0 select IRC8M */

/* CEC clock source selection */
#define RCU_CECSRC_IRC8M_DIV244     ((uint32_t)0x00000000U)               /*!< CK_CEC clock source select IRC8M/244 */
#define RCU_CECSRC_LXTAL            RCU_CFG2_CECSEL                       /*!< CK_CEC clock source select LXTAL */

/* ADC clock source selection */
#define RCU_ADCSRC_IRC28M           ((uint32_t)0x00000000U)               /*!< ADC clock source select */
#define RCU_ADCSRC_AHB_APB2DIV      RCU_CFG2_ADCSEL                       /*!< ADC clock source select */

/* IRC28M clock divider for ADC */
#define RCU_ADC_IRC28M_DIV2         ((uint32_t)0x00000000U)               /*!< IRC28M/2 select to ADC clock */
#define RCU_ADC_IRC28M_DIV1         RCU_CFG2_IRC28MDIV                    /*!< IRC28M select to ADC clock */

/* CK48M clock source selection */
#define RCU_CK48MSRC_PLL48M         ((uint32_t)0x00000000U)               /*!< CK48M source clock select PLL48M */
#define RCU_CK48MSRC_IRC48M         RCU_ADDCTL_CK48MSEL                   /*!< CK48M source clock select IRC48M */

/* Deep-sleep mode voltage */
#define DSV_DSLPVS(regval)          (BITS(0,1) & ((uint32_t)(regval) << 0))
#define RCU_DEEPSLEEP_V_0           DSV_DSLPVS(0)                         /*!< core voltage is default value in deep-sleep mode */
#define RCU_DEEPSLEEP_V_1           DSV_DSLPVS(1)                         /*!< core voltage is (default value-0.1)V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_2           DSV_DSLPVS(2)                         /*!< core voltage is (default value-0.2)V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_3           DSV_DSLPVS(3)                         /*!< core voltage is (default value-0.3)V in deep-sleep mode */

/* init struct type */
typedef enum{
    HAL_RCU_CLK_STRUCT,                                                   /*!< RCU clock structure type */
    HAL_RCU_OSCI_STRUCT,                                                  /*!< RCU oscillator structure type */
    HAL_RCU_PERIPHCLK_STRUCT,                                             /*!< RCU peripheral clock structure type */
}hal_rcu_struct_type_enum;

/* rtc clock source */
typedef enum{
    RCU_RTC_CLKSRC_NONE        = RCU_RTCSRC_NONE,        /*!< no clock selected */
    RCU_RTC_CLKSRC_LXTAL       = RCU_RTCSRC_LXTAL,       /*!< LXTAL selected as RTC source clock */
    RCU_RTC_CLKSRC_IRC40K      = RCU_RTCSRC_IRC40K,      /*!< IRC40K selected as RTC source clock */
    RCU_RTC_CLKSRC_HXTAL_DIV32 = RCU_RTCSRC_HXTAL_DIV32  /*!< HXTAL/32 selected as RTC source clock */
}hal_rcu_rtc_clksrc_enum;

/* usart clock source */
typedef enum{
    RCU_USART0_CLKSRC_APB2  = RCU_USART0SRC_CKAPB2,      /*!< CK_USART0 select CK_APB2 */
    RCU_USART0_CLKSRC_SYS   = RCU_USART0SRC_CKSYS,       /*!< CK_USART0 select CK_SYS */
    RCU_USART0_CLKSRC_LXTAL = RCU_USART0SRC_LXTAL,       /*!< CK_USART0 select LXTAL */
    RCU_USART0_CLKSRC_IRC8M = RCU_USART0SRC_IRC8M        /*!< CK_USART0 select IRC8M */
}hal_rcu_usart_clksrc_enum;

/* usbfs clock source */
typedef enum{
    RCU_PLLCLK_USBFS_DIV1_5  = RCU_USBFS_CKPLL_DIV1_5,   /*!< USBFS clock prescaler select CK_PLL/1.5 */
    RCU_PLLCLK_USBFS_DIV1    = RCU_USBFS_CKPLL_DIV1,     /*!< USBFS clock prescaler select CK_PLL */
    RCU_PLLCLK_USBFS_DIV2_5  = RCU_USBFS_CKPLL_DIV2_5,   /*!< USBFS clock prescaler select CK_PLL/2.5 */
    RCU_PLLCLK_USBFS_DIV2    = RCU_USBFS_CKPLL_DIV2,     /*!< USBFS clock prescaler select CK_PLL/2 */
    RCU_PLLCLK_USBFS_DIV3_5  = RCU_USBFS_CKPLL_DIV3_5,   /*!< USBFS clock prescaler select CK_PLL/3.5 */
    RCU_PLLCLK_USBFS_DIV3    = RCU_USBFS_CKPLL_DIV3      /*!< USBFS clock prescaler select CK_PLL/3 */
}hal_rcu_usbfs_clksrc_enum;

/* cec clock source */
typedef enum{
    RCU_CEC_CLKSRC_DIV244  = RCU_CECSRC_IRC8M_DIV244,    /*!< CK_CEC clock source select IRC8M/244 */
    RCU_CEC_CLKSRC_LXTAL   = RCU_CECSRC_LXTAL,           /*!< CK_CEC clock source select LXTAL */
}hal_rcu_cec_clksrc_enum;

/* system clock source */
typedef enum{
    RCU_SYSCLK_SRC_IRC8M = RCU_CKSYSSRC_IRC8M,           /*!< system clock source select IRC8M */
    RCU_SYSCLK_SRC_HXTAL = RCU_CKSYSSRC_HXTAL,           /*!< system clock source select HXTAL */
    RCU_SYSCLK_SRC_PLL   = RCU_CKSYSSRC_PLL              /*!< system clock source select PLL */
}hal_rcu_sysclk_src_enum;

/* CK48M clock source */
typedef enum{
    RCU_USB_CK48MSRC_PLL48M = RCU_CK48MSRC_PLL48M,       /*!< CK48M source clock select PLL48M */
    RCU_USB_CK48MSRC_IRC48M = RCU_CK48MSRC_IRC48M,       /*!< CK48M source clock select IRC48M */
}hal_rcu_ck48mclk_src_enum;

/* AHB prescaler selection */
typedef enum{
    RCU_SYSCLK_AHBDIV1   = RCU_AHB_CKSYS_DIV1,    /*!< AHB prescaler select CK_SYS */
    RCU_SYSCLK_AHBDIV2   = RCU_AHB_CKSYS_DIV2,    /*!< AHB prescaler select CK_SYS/2 */
    RCU_SYSCLK_AHBDIV4   = RCU_AHB_CKSYS_DIV4,    /*!< AHB prescaler select CK_SYS/4 */
    RCU_SYSCLK_AHBDIV8   = RCU_AHB_CKSYS_DIV8,    /*!< AHB prescaler select CK_SYS/8 */
    RCU_SYSCLK_AHBDIV16  = RCU_AHB_CKSYS_DIV16,   /*!< AHB prescaler select CK_SYS/16 */
    RCU_SYSCLK_AHBDIV64  = RCU_AHB_CKSYS_DIV64,   /*!< AHB prescaler select CK_SYS/64 */
    RCU_SYSCLK_AHBDIV128 = RCU_AHB_CKSYS_DIV128,  /*!< AHB prescaler select CK_SYS/128 */
    RCU_SYSCLK_AHBDIV256 = RCU_AHB_CKSYS_DIV256,  /*!< AHB prescaler select CK_SYS/256 */
    RCU_SYSCLK_AHBDIV512 = RCU_AHB_CKSYS_DIV512   /*!< AHB prescaler select CK_SYS/512 */
}hal_rcu_sysclk_ahbdiv_enum;

/* APB1 prescaler selection */
typedef enum{
    RCU_AHBCLK_APB1DIV1  = RCU_APB1_CKAHB_DIV1,   /*!< APB1 prescaler select CK_AHB */
    RCU_AHBCLK_APB1DIV2  = RCU_APB1_CKAHB_DIV2,   /*!< APB1 prescaler select CK_AHB/2 */
    RCU_AHBCLK_APB1DIV4  = RCU_APB1_CKAHB_DIV4,   /*!< APB1 prescaler select CK_AHB/4 */
    RCU_AHBCLK_APB1DIV8  = RCU_APB1_CKAHB_DIV8,   /*!< APB1 prescaler select CK_AHB/8 */
    RCU_AHBCLK_APB1DIV16 = RCU_APB1_CKAHB_DIV16   /*!< APB1 prescaler select CK_AHB/16 */
}hal_rcu_ahbclk_apbldiv_enum;

/* APB2 prescaler selection */
typedef enum{
    RCU_AHBCLK_APB2DIV1  = RCU_APB2_CKAHB_DIV1,   /*!< APB2 prescaler select CK_AHB */
    RCU_AHBCLK_APB2DIV2  = RCU_APB2_CKAHB_DIV2,   /*!< APB2 prescaler select CK_AHB/2 */
    RCU_AHBCLK_APB2DIV4  = RCU_APB2_CKAHB_DIV4,   /*!< APB2 prescaler select CK_AHB/4 */
    RCU_AHBCLK_APB2DIV8  = RCU_APB2_CKAHB_DIV8,   /*!< APB2 prescaler select CK_AHB/8 */
    RCU_AHBCLK_APB2DIV16 = RCU_APB2_CKAHB_DIV16   /*!< APB2 prescaler select CK_AHB/16 */
}hal_rcu_ahbclk_apb2div_enum;

/* RCU peripheal clock struct */
typedef struct{
    uint32_t periph_clock_type;                                           /*!< peripherals clock type selection */
    hal_rcu_rtc_clksrc_enum rtc_clock_source;                             /*!< RTC clock source selection */
    hal_rcu_usart_clksrc_enum usart0_clock_source;                        /*!< usart0 clock source selection */
    hal_rcu_adc_clksrc_enum adc_clock_source;                             /*!< ADC clock source selection */
    hal_rcu_usbfs_clksrc_enum usbfs_clock_source;                         /*!< USBFS clock source selection */
    hal_rcu_cec_clksrc_enum cec_clock_source;                             /*!< CEC clock source selection */
}hal_rcu_periphclk_struct;

