PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_rcu.h
/* RCU clock */
typedef struct{
    uint32_t clock_type;                          /*!< rcu clock type to be configured */
    hal_rcu_sysclk_src_enum sysclk_source;        /*!< the system clock source */
    hal_rcu_ck48mclk_src_enum ck48mclk_source;    /*!< the ck48m clock source */
    hal_rcu_sysclk_ahbdiv_enum ahbclk_divider;    /*!< the AHB clock divider */
    hal_rcu_ahbclk_apbldiv_enum apb1clk_divider;  /*!< the APB1 clock divider */
    hal_rcu_ahbclk_apb2div_enum apb2clk_divider;  /*!< the APB2 clock divider */
}hal_rcu_clk_struct;

/* RCU interrupt handler structure */
typedef struct{
    hal_irq_handle_cb pll_stable_handle;          /*!< PLL clock stable interrupt */
    hal_irq_handle_cb irc40k_stable_handle;       /*!< IRC40K clock stable interrupt */
    hal_irq_handle_cb irc8m_stable_handle;        /*!< IRC8M clock stable interrupt */
    hal_irq_handle_cb irc28m_stable_handle;       /*!< IRC28M clock stable interrupt */
    hal_irq_handle_cb irc48m_stable_handle;       /*!< IRC28M clock stable interrupt */
    hal_irq_handle_cb lxtal_stable_handle;        /*!< LXTAL clock stable interrupt */
    hal_irq_handle_cb hxtal_stable_handle;        /*!< HXTAL clock stable interrupt */
    hal_irq_handle_cb hxtal_stuck_handle;         /*!< HXTAL clock stuck interrupt */
}hal_rcu_irq_struct;

/* RCU state change timeout */
#define HAL_BP_TIMEOUT                        100U                        /*!< disable backup domain write protection state timeout (in ms) */
#define HAL_IRC8M_TIMEOUT                     4U                          /*!< IRC8M state change timeout (in ms) */
#define HAL_IRC28M_TIMEOUT                    4U                          /*!< IRC28M state change timeout (in ms) */
#define HAL_IRC48M_TIMEOUT                    4U                          /*!< IRC48M state change timeout (in ms) */
#define HAL_IRC40K_TIMEOUT                    4U                          /*!< IRC40K state change timeout (in ms) */
#define HAL_PLL_TIMEOUT                       4U                          /*!< PLL state change timeout (in ms) */

/* peripheral clock type */
#define RCU_PERIPH_CLKTYPE_NONE               (uint32_t)(0x00000000U)     /*!< no peripheal clock to configure */
#define RCU_PERIPH_CLKTYPE_RTC                (uint32_t)(0x00000001U)     /*!< RTC peripheal clock to configure */
#define RCU_PERIPH_CLKTYPE_USART0             (uint32_t)(0x00000002U)     /*!< USART0 peripheal clock to configure */
#define RCU_PERIPH_CLKTYPE_ADC                (uint32_t)(0x00000004U)     /*!< ADC peripheal clock to configure */
#define RCU_PERIPH_CLKTYPE_APB1TIMER          (uint32_t)(0x00000008U)     /*!< APB1 timer peripheal clock to get */
#define RCU_PERIPH_CLKTYPE_APB2TIMER          (uint32_t)(0x00000010U)     /*!< APB2 timer peripheal clock to get */
#define RCU_PERIPH_CLKTYPE_USBFS              (uint32_t)(0x00000020U)     /*!< USBFS peripheal clock to get */
#define RCU_PERIPH_CLKTYPE_CEC                (uint32_t)(0x00000040U)     /*!< CEC peripheal clock to get */
#define RCU_PERIPH_CLKTYPE_MAX                (uint32_t)(0x00000080U)     /*!< all peripheal clock type to configure */

/* RCU clock type */
#define RCU_CLKTYPE_NONE                      (uint32_t)(0x00000000U)     /*!< no clock to configure */
#define RCU_CLKTYPE_SYSCLK                    (uint32_t)(0x00000001U)     /*!< system clock to configure */
#define RCU_CLKTYPE_CK48MCLK                  (uint32_t)(0x00000002U)     /*!< ck48m clock to configure */
#define RCU_CLKTYPE_AHBCLK                    (uint32_t)(0x00000004U)     /*!< AHB clock to configure */
#define RCU_CLKTYPE_APB1CLK                   (uint32_t)(0x00000008U)     /*!< APB1 clock to configure */
#define RCU_CLKTYPE_APB2CLK                   (uint32_t)(0x00000016U)     /*!< APB2 clock to configure */
#define RCU_CLKTYPE_MAX                       (uint32_t)(0x0000001FU)     /*!< all clock type to configure */

/* @STRUCT_MEMBER: state */
/* @ENUM: RCU oscillator state */
typedef enum{
    RCU_OSC_NONE,                             /*!< the oscillator is not configured */
    RCU_OSC_OFF,                              /*!< the oscillator deactivation*/
    RCU_OSC_ON,                               /*!< the oscillator activation */
    RCU_OSC_BYPASS,                           /*!< external clock source for the oscillator */
    RCU_OSC_ADCCTL                            /*!< IRC28M may be clock source of ADC */
}hal_rcu_osc_state_enum;

/* @STRUCT_MEMBER: hxtal */
/* @STRUCT: RCU HXTAL status*/
typedef struct{
    ControlStatus need_configure;             /*!< the oscillators configure flag */
    hal_rcu_osc_state_enum state;             /*!< the oscillators state */
}hal_rcu_hxtal_struct;

/* @STRUCT_MEMBER: need_configure */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: lxtal */
/* @STRUCT: RCU LXTAL status*/
typedef struct{
    ControlStatus need_configure;             /*!< the oscillators configure flag */
    hal_rcu_osc_state_enum state;             /*!< the oscillators state */
}hal_rcu_lxtal_struct;

/* @STRUCT_MEMBER: need_configure */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: state */
/* @ENUM: RCU oscillator state */
/* @REFER: hal_rcu_osc_state_enum */

/* @STRUCT_MEMBER: irc8m */
/* @STRUCT: RCU IRC8M status*/
typedef struct{
    ControlStatus need_configure;             /*!< the oscillators configure flag */
    uint8_t adjust_value;                     /*!< the oscillators adjust value */
    hal_rcu_osc_state_enum state;             /*!< the oscillators state */
}hal_rcu_irc8m_struct;

/* @STRUCT_MEMBER: need_configure */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: adjust_value */
/* @=NULL */

/* @STRUCT_MEMBER: state */
/* @ENUM: RCU oscillator state */
/* @REFER: hal_rcu_osc_state_enum */

/* @STRUCT_MEMBER: irc28m */
/* @STRUCT: RCU IRC28M status*/
typedef struct{
    ControlStatus need_configure;             /*!< the oscillators configure flag */
    uint8_t adjust_value;                     /*!< the oscillators adjust value */
    hal_rcu_osc_state_enum state;             /*!< the oscillators state */
}hal_rcu_irc28m_struct;

/* @STRUCT_MEMBER: need_configure */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: adjust_value */
/* @=NULL */

/* @STRUCT_MEMBER: state */
/* @ENUM: RCU oscillator state */
/* @REFER: hal_rcu_osc_state_enum */

