PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_rcu.h
/* @STRUCT_MEMBER: irc48m */
/* @STRUCT: RCU IRC48M status*/
typedef struct{
    ControlStatus need_configure;             /*!< the oscillators configure flag */
    hal_rcu_osc_state_enum state;             /*!< the oscillators state */
}hal_rcu_irc48m_struct;

/* @STRUCT_MEMBER: need_configure */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: state */
/* @ENUM: RCU oscillator state */
/* @REFER: hal_rcu_osc_state_enum */

/* @STRUCT_MEMBER: irc40k */
/* @STRUCT: RCU IRC40K status*/
typedef struct{
    ControlStatus need_configure;            /*!< the oscillators configure flag */
    hal_rcu_osc_state_enum state;            /*!< the oscillators state */
}hal_rcu_irc40k_struct;

/* @STRUCT_MEMBER: need_configure */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: state */
/* @ENUM: RCU oscillator state */
/* @REFER: hal_rcu_osc_state_enum */

/* @STRUCT_MEMBER: pll_source */
/* @ENUM: RCU PLL source */
typedef enum{
    RCU_PLL_SRC_HXTAL_IRC48M = RCU_PLLSRC_HXTAL_IRC48M,    /*!< PLL clock source select HXTAL or IRC48M */
    RCU_PLL_SRC_IRC8M_DIV2   = RCU_PLLSRC_IRC8M_DIV2       /*!< PLL clock source select IRC8M/2 */
}hal_rcu_pll_src_enum;

/* @STRUCT_MEMBER: pre_div */
/* @ENUM: RCU PLL predivider */
typedef enum{
    RCU_PLL_PREDIV1  = RCU_PLL_PREDV1,     /*!< PLL not divided */
    RCU_PLL_PREDIV2  = RCU_PLL_PREDV2,     /*!< PLL divided by 2 */
    RCU_PLL_PREDIV3  = RCU_PLL_PREDV3,     /*!< PLL divided by 3 */
    RCU_PLL_PREDIV4  = RCU_PLL_PREDV4,     /*!< PLL divided by 4 */
    RCU_PLL_PREDIV5  = RCU_PLL_PREDV5,     /*!< PLL divided by 5 */
    RCU_PLL_PREDIV6  = RCU_PLL_PREDV6,     /*!< PLL divided by 6 */
    RCU_PLL_PREDIV7  = RCU_PLL_PREDV7,     /*!< PLL divided by 7 */
    RCU_PLL_PREDIV8  = RCU_PLL_PREDV8,     /*!< PLL divided by 8 */
    RCU_PLL_PREDIV9  = RCU_PLL_PREDV9,     /*!< PLL divided by 9 */
    RCU_PLL_PREDIV10 = RCU_PLL_PREDV10,    /*!< PLL divided by 10 */
    RCU_PLL_PREDIV11 = RCU_PLL_PREDV11,    /*!< PLL divided by 11 */
    RCU_PLL_PREDIV12 = RCU_PLL_PREDV12,    /*!< PLL divided by 12 */
    RCU_PLL_PREDIV13 = RCU_PLL_PREDV13,    /*!< PLL divided by 13 */
    RCU_PLL_PREDIV14 = RCU_PLL_PREDV14,    /*!< PLL divided by 14 */
    RCU_PLL_PREDIV15 = RCU_PLL_PREDV15,    /*!< PLL divided by 15 */
    RCU_PLL_PREDIV16 = RCU_PLL_PREDV16     /*!< PLL divided by 16 */
}hal_rcu_pll_prediv_enum;

/* @STRUCT_MEMBER: pll_mul */
/* @ENUM: RCU PLL multiply factor */
typedef enum{
    RCU_PLL_MULT2  = RCU_PLL_MUL2,                /*!< PLL source clock multiply by 2 */
    RCU_PLL_MULT3  = RCU_PLL_MUL3,                /*!< PLL source clock multiply by 3 */
    RCU_PLL_MULT4  = RCU_PLL_MUL4,                /*!< PLL source clock multiply by 4 */
    RCU_PLL_MULT5  = RCU_PLL_MUL5,                /*!< PLL source clock multiply by 5 */
    RCU_PLL_MULT6  = RCU_PLL_MUL6,                /*!< PLL source clock multiply by 6 */
    RCU_PLL_MULT7  = RCU_PLL_MUL7,                /*!< PLL source clock multiply by 7 */
    RCU_PLL_MULT8  = RCU_PLL_MUL8,                /*!< PLL source clock multiply by 8 */
    RCU_PLL_MULT9  = RCU_PLL_MUL9,                /*!< PLL source clock multiply by 9 */
    RCU_PLL_MULT10 = RCU_PLL_MUL10,               /*!< PLL source clock multiply by 10 */
    RCU_PLL_MULT11 = RCU_PLL_MUL11,               /*!< PLL source clock multiply by 11 */
    RCU_PLL_MULT12 = RCU_PLL_MUL12,               /*!< PLL source clock multiply by 12 */
    RCU_PLL_MULT13 = RCU_PLL_MUL13,               /*!< PLL source clock multiply by 13 */
    RCU_PLL_MULT14 = RCU_PLL_MUL14,               /*!< PLL source clock multiply by 14 */
    RCU_PLL_MULT15 = RCU_PLL_MUL15,               /*!< PLL source clock multiply by 15 */
    RCU_PLL_MULT16 = RCU_PLL_MUL16,               /*!< PLL source clock multiply by 16 */
    RCU_PLL_MULT17 = RCU_PLL_MUL17,               /*!< PLL source clock multiply by 17 */
    RCU_PLL_MULT18 = RCU_PLL_MUL18,               /*!< PLL source clock multiply by 18 */
    RCU_PLL_MULT19 = RCU_PLL_MUL19,               /*!< PLL source clock multiply by 19 */
    RCU_PLL_MULT20 = RCU_PLL_MUL20,               /*!< PLL source clock multiply by 20 */
    RCU_PLL_MULT21 = RCU_PLL_MUL21,               /*!< PLL source clock multiply by 21 */
    RCU_PLL_MULT22 = RCU_PLL_MUL22,               /*!< PLL source clock multiply by 22 */
    RCU_PLL_MULT23 = RCU_PLL_MUL23,               /*!< PLL source clock multiply by 23 */
    RCU_PLL_MULT24 = RCU_PLL_MUL24,               /*!< PLL source clock multiply by 24 */
    RCU_PLL_MULT25 = RCU_PLL_MUL25,               /*!< PLL source clock multiply by 25 */
    RCU_PLL_MULT26 = RCU_PLL_MUL26,               /*!< PLL source clock multiply by 26 */
    RCU_PLL_MULT27 = RCU_PLL_MUL27,               /*!< PLL source clock multiply by 27 */
    RCU_PLL_MULT28 = RCU_PLL_MUL28,               /*!< PLL source clock multiply by 28 */
    RCU_PLL_MULT29 = RCU_PLL_MUL29,               /*!< PLL source clock multiply by 29 */
    RCU_PLL_MULT30 = RCU_PLL_MUL30,               /*!< PLL source clock multiply by 30 */
    RCU_PLL_MULT31 = RCU_PLL_MUL31,               /*!< PLL source clock multiply by 31 */
    RCU_PLL_MULT32 = RCU_PLL_MUL32,               /*!< PLL source clock multiply by 32 */
    RCU_PLL_MULT33 = (int)RCU_PLL_MUL33,          /*!< PLL source clock multiply by 33 */
    RCU_PLL_MULT34 = (int)RCU_PLL_MUL34,          /*!< PLL source clock multiply by 34 */
    RCU_PLL_MULT35 = (int)RCU_PLL_MUL34,          /*!< PLL source clock multiply by 35 */
    RCU_PLL_MULT36 = (int)RCU_PLL_MUL36,          /*!< PLL source clock multiply by 36 */
    RCU_PLL_MULT37 = (int)RCU_PLL_MUL37,          /*!< PLL source clock multiply by 37 */
    RCU_PLL_MULT38 = (int)RCU_PLL_MUL38,          /*!< PLL source clock multiply by 38 */
    RCU_PLL_MULT39 = (int)RCU_PLL_MUL39,          /*!< PLL source clock multiply by 39 */
    RCU_PLL_MULT40 = (int)RCU_PLL_MUL40,          /*!< PLL source clock multiply by 40 */
    RCU_PLL_MULT41 = (int)RCU_PLL_MUL41,          /*!< PLL source clock multiply by 41 */
    RCU_PLL_MULT42 = (int)RCU_PLL_MUL42,          /*!< PLL source clock multiply by 42 */
    RCU_PLL_MULT43 = (int)RCU_PLL_MUL43,          /*!< PLL source clock multiply by 43 */
    RCU_PLL_MULT44 = (int)RCU_PLL_MUL44,          /*!< PLL source clock multiply by 44 */
    RCU_PLL_MULT45 = (int)RCU_PLL_MUL45,          /*!< PLL source clock multiply by 45 */
    RCU_PLL_MULT46 = (int)RCU_PLL_MUL46,          /*!< PLL source clock multiply by 46 */
    RCU_PLL_MULT47 = (int)RCU_PLL_MUL47,          /*!< PLL source clock multiply by 47 */
    RCU_PLL_MULT48 = (int)RCU_PLL_MUL48,          /*!< PLL source clock multiply by 48 */
    RCU_PLL_MULT49 = (int)RCU_PLL_MUL49,          /*!< PLL source clock multiply by 49 */
    RCU_PLL_MULT50 = (int)RCU_PLL_MUL50,          /*!< PLL source clock multiply by 50 */
    RCU_PLL_MULT51 = (int)RCU_PLL_MUL51,          /*!< PLL source clock multiply by 51 */
    RCU_PLL_MULT52 = (int)RCU_PLL_MUL52,          /*!< PLL source clock multiply by 52 */
    RCU_PLL_MULT53 = (int)RCU_PLL_MUL53,          /*!< PLL source clock multiply by 53 */
    RCU_PLL_MULT54 = (int)RCU_PLL_MUL54,          /*!< PLL source clock multiply by 54 */
    RCU_PLL_MULT55 = (int)RCU_PLL_MUL55,          /*!< PLL source clock multiply by 55 */
    RCU_PLL_MULT56 = (int)RCU_PLL_MUL56,          /*!< PLL source clock multiply by 56 */
    RCU_PLL_MULT57 = (int)RCU_PLL_MUL57,          /*!< PLL source clock multiply by 57 */
    RCU_PLL_MULT58 = (int)RCU_PLL_MUL58,          /*!< PLL source clock multiply by 58 */
    RCU_PLL_MULT59 = (int)RCU_PLL_MUL59,          /*!< PLL source clock multiply by 59 */
    RCU_PLL_MULT60 = (int)RCU_PLL_MUL60,          /*!< PLL source clock multiply by 60 */
    RCU_PLL_MULT61 = (int)RCU_PLL_MUL61,          /*!< PLL source clock multiply by 61 */
    RCU_PLL_MULT62 = (int)RCU_PLL_MUL62,          /*!< PLL source clock multiply by 62 */
    RCU_PLL_MULT63 = (int)RCU_PLL_MUL63,          /*!< PLL source clock multiply by 63 */
    RCU_PLL_MULT64 = (int)RCU_PLL_MUL64           /*!< PLL source clock multiply by 64 */
}hal_rcu_pll_mul_enum;

