PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_rcu.h
/* @STRUCT_MEMBER: pll_presel */
/* @ENUM: PLL clock source preselection */
typedef enum{
    RCU_PLL_PRESEL_HXTAL  = RCU_PLLPRESEL_HXTAL,  /*!< PLL clock source preselection HXTAL */
    RCU_PLL_PRESEL_IRC48M = RCU_PLLPRESEL_IRC48M  /*!< PLL clock source preselection IRC48M */
}hal_rcu_pll_presel_enum;

/* @STRUCT_MEMBER: pll */
/* @STRUCT: RCU PLL*/
typedef struct{
    ControlStatus need_configure;             /*!< the oscillators configure flag */
    hal_rcu_osc_state_enum state;             /*!< the oscillators state */
    hal_rcu_pll_src_enum pll_source;          /*!< PLL entry clock source */
    hal_rcu_pll_prediv_enum pre_div;          /*!< predivision factor of PLL input clock */
    hal_rcu_pll_mul_enum pll_mul;             /*!< multiplication factor of PLL input clock */
    hal_rcu_pll_presel_enum pll_presel;       /*!< source preselection of PLL input clock */
}hal_rcu_pll_struct;

/* @STRUCT_MEMBER: need_configure */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: state */
/* @ENUM: RCU oscillator state */
/* @REFER: hal_rcu_osc_state_enum */

/* @PARA: rcu_osci */
/* @STRUCT: RCU oscillators struct*/
typedef struct{
    hal_rcu_hxtal_struct hxtal;               /*!< HXTAL status structure */
    hal_rcu_lxtal_struct lxtal;               /*!< LXTAL status structure */
    hal_rcu_irc8m_struct irc8m;               /*!< IRC8M status structure */
    hal_rcu_irc28m_struct irc28m;             /*!< IRC28M status structure */
    hal_rcu_irc48m_struct irc48m;             /*!< IRC48M status structure */
    hal_rcu_irc40k_struct irc40k;             /*!< IRC40K status structure */
    hal_rcu_pll_struct pll;                   /*!< PLL structure parameters */
}hal_rcu_osci_struct;

/* @FUNCTION: configure the RCU oscillators */
int32_t hal_rcu_osci_config(hal_rcu_osci_struct *rcu_osci);

/* configure the clock out to output on CKOUT pin */
/* @PARA: ckout_src */
/* @ENUM: RCU clock out source */
typedef enum{
    RCU_CKOUT_SRC_NONE       = 0U,               /*!< no clock selected */
    RCU_CKOUT_SRC_IRC28M     = 1U,               /*!< CK_OUT clock source select IRC28M */
    RCU_CKOUT_SRC_IRC40K     = 2U,               /*!< CK_OUT clock source select IRC40K */
    RCU_CKOUT_SRC_LXTAL      = 3U,               /*!< CK_OUT clock source select LXTAL */
    RCU_CKOUT_SRC_CKSYS      = 4U,               /*!< CK_OUT clock source select CKSYS */
    RCU_CKOUT_SRC_IRC8M      = 5U,               /*!< CK_OUT clock source select IRC8M */
    RCU_CKOUT_SRC_HXTAL      = 6U,               /*!< CK_OUT clock source select HXTAL */
    RCU_CKOUT_SRC_CKPLL_DIV2 = 7U,               /*!< CK_OUT clock source select PLL/2 */
    RCU_CKOUT_SRC_CKPLL_DIV1 = 8U                /*!< CK_OUT clock source select PLL */
}hal_rcu_ckout_src_enum;

/* @PARA: ckout_div */
/* @ENUM: RCU clock out divider */
typedef enum{
    RCU_CLKOUT_DIV1   = RCU_CKOUT_DIV1,          /*!< CK_OUT is divided by 1 */
    RCU_CLKOUT_DIV2   = RCU_CKOUT_DIV2,          /*!< CK_OUT is divided by 2 */
    RCU_CLKOUT_DIV4   = RCU_CKOUT_DIV4,          /*!< CK_OUT is divided by 4 */
    RCU_CLKOUT_DIV8   = RCU_CKOUT_DIV8,          /*!< CK_OUT is divided by 8 */
    RCU_CLKOUT_DIV16  = RCU_CKOUT_DIV16,         /*!< CK_OUT is divided by 16 */
    RCU_CLKOUT_DIV32  = RCU_CKOUT_DIV32,         /*!< CK_OUT is divided by 32 */
    RCU_CLKOUT_DIV64  = RCU_CKOUT_DIV64,         /*!< CK_OUT is divided by 64 */
    RCU_CLKOUT_DIV128 = RCU_CKOUT_DIV128         /*!< CK_OUT is divided by 128 */
}hal_rcu_ckout_div_enum;

/* @FUNCTION: configure the clock out to output on CKOUT pin */
void hal_rcu_clock_out_config(hal_rcu_ckout_src_enum ckout_src, \
                              hal_rcu_ckout_div_enum ckout_div);
/* @END */

/* function declarations */
/* deinitialize the RCU */
void hal_rcu_deinit(void);

/* initialize the RCU structure with the default values */
/* deinitialize RCU */
void hal_rcu_struct_init(hal_rcu_struct_type_enum rcu_struct_type, void *p_struct);

/* enable the peripherals clock */
void hal_rcu_periph_clk_enable(hal_rcu_periph_enum periph);

/* disable the peripherals clock */
void hal_rcu_periph_clk_disable(hal_rcu_periph_enum periph);

/* enable the HXTAL clock monitor */
void hal_rcu_hxtal_clock_monitor_enable(void);
    
/* disable the HXTAL clock monitor */
void hal_rcu_hxtal_clock_monitor_disable(void);

/* reset the peripherals */
void hal_rcu_periph_reset_enable(hal_rcu_periph_reset_enum periph_reset);

/* disable reset the peripheral */
void hal_rcu_periph_reset_disable(hal_rcu_periph_reset_enum periph_reset);

/* initialize the RCU extended peripherals(RTC, Usart0, ADC, USBFS, CEC) clocks */
int32_t hal_rcu_periph_clock_config(hal_rcu_periphclk_struct *periph_clk);

/* get the peripherals clock frequency */
uint32_t hal_rcu_periph_clkfreq_get(uint32_t periph_clk);

/* get the RCU oscillators configuration */
void hal_rcu_osci_config_get(hal_rcu_osci_struct *rcu_osci);

/* configure the RCU clock */
int32_t hal_rcu_clock_config(hal_rcu_clk_struct *rcu_clk);

/* get the RCU clock configuration */
void hal_rcu_clock_config_get(hal_rcu_clk_struct *rcu_clk);

/* update the SystemCoreClock with current core clock retrieved from cpu registers */
int32_t hal_SystemCoreClockUpdate(void);

/* RCU interrupt handler content function,which is merely used in RCU_handler */
void hal_rcu_irq(void);

/* set user-defined interrupt callback function, 
which will be registered and called when corresponding interrupt be triggered */
void hal_rcu_irq_handle_set(hal_rcu_irq_struct *prcu_irq);

/* reset all user-defined interrupt callback function, 
which will be registered and called when corresponding interrupt be triggered */
void hal_rcu_irq_handle_all_reset(void);


/* reset the BKP */
void hals_rcu_bkp_reset_enable(void);

/* disable the BKP reset */
void hals_rcu_bkp_reset_disable(void);

/* get the clock stabilization and periphral reset flags */
FlagStatus hals_rcu_flag_get(hal_rcu_flag_enum flag);

/* clear the reset flag */
void hals_rcu_all_reset_flag_clear(void);

/* wait until oscillator stabilization flags is SET */
ErrStatus hals_rcu_osci_stab_wait(hal_rcu_osci_type_enum osci);

/* configure the RTC clock source selection */
void hals_rcu_rtc_clock_config(uint32_t rtc_clock_source);

