PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_rcu.h
/* configure the USART clock source selection */
void hals_rcu_usart_clock_config(uint32_t ck_usart);

/* configure the ADC clock prescaler selection */
void hals_rcu_adc_clock_config(hal_rcu_adc_clksrc_enum ck_adc);

/* configure the CEC clock source selection */
void hals_rcu_cec_clock_config(uint32_t ck_cec);

/* configure the USBFS clock prescaler selection */
void hals_rcu_usbfs_clock_config(uint32_t ck_usbfs);

/* get the system clock, bus and peripheral clock frequency */
uint32_t hals_rcu_clock_freq_get(hal_rcu_clock_freq_enum clock);

/* get the system clock source */
uint32_t hals_rcu_system_clock_source_get(void);

/* turn on the oscillator */
void hals_rcu_osci_on(hal_rcu_osci_type_enum osci);

/* turn off the oscillator */
void hals_rcu_osci_off(hal_rcu_osci_type_enum osci);

/* enable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it */
void hals_rcu_osci_bypass_mode_enable(hal_rcu_osci_type_enum osci);

/* disable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it */
void hals_rcu_osci_bypass_mode_disable(hal_rcu_osci_type_enum osci);

/* set the IRC8M adjust value */
void hals_rcu_irc8m_adjust_value_set(uint8_t irc8m_adjval);

/* set the IRC28M adjust value */
void hals_rcu_irc28m_adjust_value_set(uint8_t irc28m_adjval);

/* configure the PLL clock source preselection */
void hals_rcu_pll_preselection_config(uint32_t pll_presel);

/* configure the HXTAL divider used as input of PLL */
void hals_rcu_hxtal_prediv_config(uint32_t hxtal_prediv);

/* configure the PLL clock source selection and PLL multiply factor */
void hals_rcu_pll_config(uint32_t pll_src, uint32_t pll_mul);

/* configure the system clock source */
void hals_rcu_system_clock_source_config(uint32_t ck_sys);

/* configure the AHB clock prescaler selection */
void hals_rcu_ahb_clock_config(uint32_t ck_ahb);

/* configure the APB1 clock prescaler selection */
void hals_rcu_apb1_clock_config(uint32_t ck_apb1);

/* configure the APB2 clock prescaler selection */
void hals_rcu_apb2_clock_config(uint32_t ck_apb2);

/* configure the CK48M clock source selection */
void hals_rcu_ck48m_clock_config(uint32_t ck48m_clock_source);

/* configure the CK_OUT clock source and divider */
void hals_rcu_ckout_config(uint32_t ckout_src, uint32_t ckout_div);

/* get the clock stabilization interrupt and ckm flags */
FlagStatus hals_rcu_interrupt_flag_get(hal_rcu_int_flag_enum int_flag);

/* clear the interrupt flags */
void hals_rcu_interrupt_flag_clear(hal_rcu_int_flag_clear_enum int_flag_clear);

/* enable the stabilization interrupt */
void hals_rcu_interrupt_enable(hal_rcu_int_enum stab_int);

/* disable the stabilization interrupt */
void hals_rcu_interrupt_disable(hal_rcu_int_enum stab_int);
    
#endif /* GD32F3X0_HAL_RCU_H */
